//1. Вам дана переменная num, присвойте ей значение. Выведите значение этой переменной в консоль.
// let num = 10
// console.log(num)
//2. Вам даны переменные a=10, b=2 и c=5. Выведите в консоль их сумму.
// let a = 12
// let b = 9
// let c = 5
// console.log(a +b + c)
//3. Вам дана переменная со значением 100, выведите в консоль умноженную переменную на 2.
// let m = 100
// console.log(m * 2)
//4. Вам дана переменная со значением 67. Выведите в консоль остаток деления на 7.
// const s = 67
// console.log(s % 7)
//5. Вам даны переменные a=10 и b=2. Выведите в консоль их сумму, разность, произведение и частное (результат деления).
// let a = 10
// let b = 2
// console.log(a + b, a * b, a - b, a / b )
//6. Вам даны переменные c=15 и d=2.
// Просуммируйте их, а результат присвойте переменной result. Выведите в консоль значение переменной result.
// let c = 15
// let d = 2
// let result = c + d
// console.log(result)
//7. Вам даны переменные a=30, и b=15 Сложите переменные a и b и результат присвойте переменной c.
// Затем выведите в консоль остаток деления на 4 переменной c.
// let a = 30
// let b = 15
// let c = a + b
// console.log(c %4)
//8. Вам даны переменные a=17 и b=10. Отнимите от a переменную b и результат присвойте переменной c.
// Затем создайте переменную d, присвойте ей значение.
// Сложите переменные c и d, а результат запишите в переменную result. Выведите в консоль значение переменной result.
// let a = 17
// let b = 10
// let c = a - b
// let d = 5
// let result = c + d
// console.log(result)
// Строки:
//     1. Вам дана переменная str, присвойте ей значение 'Привет, Мир!'. Выведите значение этой переменной в консоль.
// 2. Вам даны переменные str1='Привет, ' и str2='Мир!'. С помощью этих переменных и операции сложения строк выведите в консоль фразу 'Привет, Мир!'.
// let str1='привет'
// let str2='мир!'
// console.log(str1+str2)
// console.log(str1.concat(str2))
// // 3. Вам дана переменная name, присвойте ей ваше имя. Выведите в консоль фразу 'Привет, *Имя*!'.
// let name ="Solton"
// console.log(`Hello ${name}`)
// console.log("Hello "+name)
// 4. Вам дана переменная age , присвойте ей ваш возраст. Выведите в консоль 'Мне *Возраст* лет!'.

// 5. Вам даны четыре переменные.
//     Первая - для хранения количества дней. Присвойте ей значение "365".
//     Вторая - для хранения названия нашей планеты "Земля".
//     Третья - для хранения примерного количества жителей нашей планеты. Присвойте ей значение "7 млрд.".
//     Четвертая - для хранения слова "Солнце".
//     Далее, используя текст и переменные, нужно вывести в консоль такой абзац:
//     "В нашем году 365 дней. Днём у нас светит Солнце. Население планеты Земля составляет примерно 7 млрд. человек."
// let days=365
// let planet ="Земля"
// let people="7 млрд."
// let sun= "Солнце"
// console.log(`В нашем году ${days} дней. Днём у нас светит ${sun}. Население планеты ${planet} составляет примерно ${people} человек.`)
//
// Typeof:
//     1. Вам дана переменная a=50. Выведите в консоль тип значения этой переменной.
// 2. Вам даны переменные a=10, b=35. Создайте переменную result, и сделайте так, чтобы в консоли значение переменной result было string.
// 3. Вам дана переменная a=10, выведите в консоль тип этой переменной - string.
// 1. Вам дана переменная a. Если переменная a равна 10, то выведите 'Верно', иначе выведите 'Неверно'.
// 2. Вам даны две переменные a=50, b=100. Составьте условие, по которому в консоль будет выводиться 'a больше b', 'a меньше b'.
// 3. Вам дана переменная a=-2. Составьте условие, по которому в консоль будет выводиться 'positive' - если число больше 0, 'равно' если число равно 0, "negative" если число меньше 0.
// 4. Вам дана переменная number=45. Составьте условие, по которому будет выводиться в консоль "Четное число", "Нечетное число".
// 5. Вам даны две переменные a=10, b=2. Составьте условие, по которому, остаток деления a на b, будет выводиться консоль "Четное число", "Нечетное число".
// 6. Вам дана переменная s. Составьте условие, по которому в консоль будет выводится тип этой переменной - "boolean", "number", "string".
// 7. Вам дана переменная а. Если переменная a больше одного и меньше 9-ти, то выведите 'Верно', иначе выведите 'Неверно'.
// 8. Вам дана переменная а. Если переменная a равна трем или равна семи, то прибавьте к ней 7, иначе поделите ее на 10. Выведите новое значение переменной в консоль.
// 9. Вам даны переменные а , b. Если переменная a равна или меньше 0, а переменная b больше или равна 5, то выведите сумму этих переменных, иначе выведите их разность (результат вычитания).
// 10. Вам даны переменные a , b. Если переменная a больше 4-х и меньше 10-ти, или переменная b больше или равна 7-ми и меньше 17-ти, то выведите 'Верно', в противном случае выведите 'Неверно'.
// 11. Вам дана переменная month. В ней лежит какое-то число из интервала от 1 до 12. Определите в какую пору года попадает этот месяц (зима, лето, весна, осень).
// 12. Вам дана переменная day. В ней лежит какое-то число из интервала от 1 до 31. Определите в какую декаду месяца попадает это число (в первую, вторую или третью).
// 13. Вам дана переменная a='12345'. Проверьте, что первым символом этой переменной является цифра 1, 2 или 3. Если это так – выведите ‘да’, в противном случае выведите ‘нет’.
// 14. Вам дана переменная age=*любое двузначное число*. Составьте условие, по которому, в консоль будет выводиться "Мне  год", "Мне  лет", в зависимости от возраста. Наример мне 21 год, мне 20 лет.
// 15. Вам дана переменная time= *любое чило от 1 до 59*. Составьте условие, по которому время будет делиться на четверти. Пример: time = 12 - Первая четверть.
// Если число больше 60, то в консоли будет выдаваться "Неверное число".
//[Forwarded from Askar]
// 1  Дан массив ['a', 'b', 'c']. Добавьте ему в конец элементы 1, 2, 3.
//  let array = ['a', 'b', 'c']
// array.splice(3,0,"1,2,3")
//  console.log(array)
// 2 Даны два массива: [1, 2, 3] и [4, 5, 6]. Объедините их вместе.
// let array = [1,2,3]
//  let array =[4,5,6]
// console.log(names.concat(array))
// 3 Дан массив [1, 2, 3]. Добавьте ему в конец элементы 4, 5, 6.
// let array = [1,2,3]
//  array.splice(3,0,4,5,6)
//   console.log(array)
// 4 Дан массив [1, 2, 3]. Добавьте ему в начало элементы 4, 5, 6.
 //let array = [1,2,3]
 //array.unshift(4,5,6)
 //console.log(array)
// 5 Дан массив ['js', 'css', 'jq']. Выведите на экран первый элемент.
 //let array = ['js','css','jq']
 //array.splice(1,2,)
 //console.log(array)
// 6 Дан массив ['js', 'css', 'jq']. Выведите на экран последний элемент.
// let array = ['js','css','jq']
 //array.splice(0,2)
// console.log(array)
// 7  Дан массив [1, 2, 3, 4, 5]. С помощью метода slice запишите в новый элементы [1, 2, 3].
// let array = [1,2,3,4,5]
// console.log(array.slice(0,3))
// 8  Дан массив [1, 2, 3, 4, 5].
// С помощью метода slice запишите в новый элементы [4, 5].
// let array = [1,2,3,4,5]
// console.log(array.slice(3))
// 9  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice преобразуйте массив в [1, 4, 5].
// let array = [1,2,3,4,5]
// array.splice(1,2,)
// console.log(array)
// 10  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice запишите в новый массив элементы [2, 3, 4].
// let array = [1,2,3,4,5]
// array.splice(0,1)
// array.splice(3,2)
// console.log(array)
// 11  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// let array = [1,2,3,4,5]
// array.splice(3,0,'a', 'b','c')
// console.log(array)
// 12  Дан массив [1, 2, 3, 4, 5]. С помощью метода splice сделайте из него массив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// let array = [1,2,3,4,5]
// array.splice(1,0,'a', 'b')
// array.splice(6,0,'c')
// array.splice(8,0,'e')
// console.log(array)
// 13  Дан массив [3, 4, 1, 2, 7]. Отсортируйте его.
// let array = [3,4,1,2,7]
// array.unshift(1,2)
// array.splice(4,2)
// console.log(array)
// 14 биринчи элемент кайтарып берет
// var array = [1,2,3,4,5,6,7,8,9];
//function getFirst(array) {
  // return
 //};
// 15 акыркы элемент кайтарып берет
// var array = [1,2,3,4,5,6,7,8,9];
//
//  function getLast(array, n) {
//     ваш код
// };
// 2. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат'].
// Создайте функцию, изменяющую букву а в каждом имени на я и выведите в консоль.
//let names = ['Аскар', 'Баяман', 'Калмамат']

// const task2 = array => {
//     return array.map((el) =>{
//     return el.split("").map(letter => }
//     )
//     })
// }
// 3. Вам дан массив: ['Аскар', 'Баяман', 'Калмамат'].
// Создайте функцию, которая выводит только те имена, где есть буква к и выведите в консоль.
//  let b = ['Аскар', 'Баяман', 'калмамат']
//  console.log(b.filter(function (el){
//    return el.includes("к")
// }))
// 4. Вам дан массив: [4, 54, 49].
// Сделайте из него массив, состоящий из квадратов этих чисел.
// let arr = [4, 54, 49]
// const task4 = array =>{
//     return array.map(number =>{
//         return number * number
//     })
// }
// console.log(task4([4,54,49]))
// 5. Вам дан массив [3134, 4, -143, -245, -214].
// Оставьте в нем только отрицательные числа.
// let arr = [3134, 4, -143, -245, -214];
// let result = arr.filter(item => item < 0)
//     .sort((a, b) => a - b);
// console.log(result);
// 6. Вам дан массив [3, 51, 30, 54, 60]. Оставьте в нем только четные числа.
// let num = [3,51,30,54,60]
// console.log(num.filter(function (el, idx,arr){
//     return el % 2 === 0
//  }))
// 7. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат']. Оставьте в нем только те строки, длина которых больше 5-ти символов.
// let names = ['Бегимай', 'Баяман', 'Калмамат'];
// console.log(result = names.filter(word => word.length > 5))
// 8. Вам дан массив [-13, 96, -41, -28, 40]. Посчитайте количество отрицательных чисел в этом массиве.
// let a = [-13, 96, -41, -28, 40]
// console.log(([-13, 96, -41, -28, 40]))
// 9. Вам дан массив [3, 51, -30, -54, 60]. Оставьте в нем только положительные числа.
// Затем извлеките квадратный корень из этих чисел, если эти числа больше 30.
//  const arr = [3, 51, -30, -54, 60];
//  const result = arr.filter(item => item > 0)
//     .sort((a, b) => a - b);
//  console.log(result);
// console.log(Math.sqrt(result))
// 10. Вам дан массив [55, 44, 55, 44, 15, 49].
// Оставьте в нем только неповторяющиеся числа.

// 11. Вам дан массив [NaN, 0, 77, false, -17, '',undefined, 99, null].\
// Создайте функцию, которая очищает массив от ложных (false) значений: false, null, undefined, 0, –0, NaN и "" (пустая строка).
// let data = [NaN, undefined, 0, -0, null, "", false]
// console.log(data.filter(function (el){
//     return el
//}))
// 12. Вам дан массив ['Бегимай', 'Баяман', 'Калмамат'].
// Выведите длину каждой строки.
// let words = ['Бегимай', 'Баяман', 'Калмамат'];
// let result = words.filter(word => word.length > 6);
// console.log(result);

// let arr = [34, 45, 67, 89,10]
// console.log(arr.map(l=>{
//     return l.toString()
// }))


// let array = [12,34,56,78,90,77,37,53]
// console.log(array.map(el=>{
//     if (el % 2===0){
//         return " жуп сан"
//     }else{
//         return "так сан"
//     }
// }))
//
// let data = [ "aa", 1, true, null, undefined, {}]
// console.log(data.map(n =>{
//     return typeof n
// }))ё

//
// const r = (number) =>{
//     return new Array(number ).fill(0).map(n=>{
//         return Math.floor(Math.random()*10+1)
//     })
// }
//
// console.log(r(25))
// console.log(r(45))
//
//
// let s = [1,2,3,4,5,6,7,8,9,10]
//  console.log(s.filter(function (el, idx,arr){
//     return el % 2 === 0
//  }))
//
// let nam = ["chapai", "bakai", "nazar", "solton" ]
// console.log(nam.map(el =>{
//     return el.slice(1,-1)
// }))

// console.log(nam.map(el=>{
//     console.log(el)
//     return el.split("").map((n,idx) =>{
//     if(idx ===0){
//         n = el[el.leght -1]
//     }else{
//         else if(idx === el.lenght -1){
//             n = Lastletter
//         }
//
//     }
//     return n
//     }).join
//
// }))




//Во всех задачах используйте только методы map, reduce.
// 1. Вам дан массив с числами [5,15,315,2,13,20,9]. Найдите сумму этих чисел.
// let a = [5,15,315,2,13,20,9]
// console.log(a.reduce(function(acc,el){
//     return acc +el
// },0))
// 2. Вам дан массив с числами [5,12,314,2,13,20,9]. Найдите сумму всех четных чисел.
// let arr = [5,12,314,2,13,20,9]
// console.log(arr.reduce(function(acc,el){
//     if(el %2 ===0){
//         return acc+el
//     }else{
//         return acc
//     }
// }))
// 3. Вам дан массив с числами [5,15,315,2,13,20,9]. Найдите сумму чисел, которые больше 10.
// let a = [5,15,315,2,13,20,9]
// console.log(a.reduce(function(acc,el){
//     if(el>10){
//         return acc+el
//     }else{
//         return acc
//     }
// },0))
// 4. Вам дан массив с числами [3,13,54,15,335, 39]. Найдите разность чисел, которые больше 10.
// let a = [3,13,54,15,335, 39]
// console.log(a.reduce(function(acc,el){
//     if(el>10){
//         return acc- el
//     }else{
//         return acc
//     }
// },0))
// 5. Вам дан массив с строками ['Аскар', 'Баяман', 'Калмамат'].
// Сложите все строки и выведите длину результата.
// let a = ['Аскар', 'Баяман', 'Калмамат']
// console.log(a.reduce(function(acc,el){
//     return acc.concat(el)
// },"").length)
// 6. Вам дан массив с строками ['Аскар', 'Баяман', 'Калмамат']. Выведите все строки в верхнем регистре, используя map.
// let arra = ['Аскар', 'Баяман', 'Калмамат','Salima']
// console.log(arra.map(function(el){
//     return el.toUpperCase()
// }))
//
//
// console.log(arra.reduce(function(acc,el){
//     acc.push(el.toUpperCase())
//     return acc
// },[]))
// // // 7. Вам дан массив с строками ['Аскар', 'Баяман', 'Калмамат']. Выведите все вторые строки в верхнем регистре.
// console.log(arra.map(function(el,idx){
//     if(idx % 2){
//         return el.toUpperCase()
//     }else{
//        acc.push(el.toLowerCase())
//     }
// }))


// console.log(arra.reduce(function(acc,el,idx){
//     if(idx %2){
//         return el.toUpperCase()
//     }else{
//         return el.toLowerCase
//     }
// },[]))
// 8. Напишите функцию, которая принимает str, target. И возвращает true или false, если targer присутствует в str. Использовать .reduce для этого.
//Пример: isPresent ('abcd', 'b') => true
//isPresent ('efghi', 'a') // => false

// 9. Вам дан массив с строками ['асКар', 'бЯяман', 'калМмамат']. Используйте заглавные буквы в каждом массиве имен.
// Пример: (["john", "JACOB", "jinGleHeimer", "schmidt"])), => ["John", "Jacob", "Jingleheimer", "Schmidt"]
// 10. Вам дан массив со строками ['Баяман', 'Калмамат']. Поменяйте местами первые буквы строк.
// let names = ['Баяман', 'Калмамат']
// console.log(names.map((el,idx){
//
// }))
// 11. Вам дан массив [true, '1234', 325]. Напишите функцию, которая проверяет, все ли элементы массива относятся к одному типу данных.
//  const dataCheck = (data) => {
// return data.every((el) =>{
//      return typeof data [0] === typeof el
//  })
//      return data.reduce((acc,el,idx) =>{
//          if (idx !== data.length - 1){
//               return acc && (typeof el === data [idx + 1])
//          }
//          return acc
//      },false)
// }
//
//  console.log(dataCheck([true, '1234', 325]))
//  console.log(dataCheck([1,1,1,1, 325, "0"]))
//  console.log(dataCheck([1,1,true,1,1, 325]))
 //console.log(dataCheck([1,1,0,1,1, 325]))
// 12. Вам дана строка 'тестинг'. Ваша задача - вернуть средний символ слова.
// Если длина слова нечетная, верните средний символ. Если длина слова четная, вернуть 2 средних символа.

// 13. Вам дан массив с числами [5, -3, 13, -7, 45]. Верните сумму всех положительных чисел.

// 14. Вам дан массив с числами [5, -54, 13, -7, 45, -15, -34]. Верните сумму всех отрицательных чисел, которые больше 10.

// 15. Вам дан массив с числами [1, 65, 13 , 30, 100] - все числа - доллары.
// Вам нужно обменять эти доллары по курсу сома и вывести все числа в сомах.


// 16. Вам дан массив со строками ['Lorem ipsum dor sit omet devour il ela sit'].
// Выведите каждый нечетный индекс в строке в верхнем регистре.

// 17. Вам дан массив с строками ['Оскар', 'Баяман', 'Калмамат'].
// Добавьте к каждой строке нумерацию.

// 18. Вам дан массив с числами [2,456,6,8]. Напишите функцию ,
// которая вставляет дефис (-) между каждыми двумя четными числами.
// Например, если вы принимаете 025468, на выходе должно быть 0-254-6-8.

// 20. Вам дан массив с числами [5,15,315,2,13,20,9]. Посчитайте среднее арифметическое чисел в массиве.

//1. Создайте объект obj = {a: 1, b: 2, c: 3}. Выведите длину ключей.
//  let obj = {a: 1, b: 2, c: 3}
//  console.log(obj.key(obj).length)

// 2. Создайте объект obj = {a: 1, b: 2, c: 3}. Выведите на экран элемент с ключом 'c' двумя способами:
// через квадратные скобки и как свойство объекта.
// let obj = {a: 1, b: 2, c: 3}
// console.log(obj.c)
// console.log(obj["c"])
// 3. Создайте объект заработных плат obj = {Ширин: '1000', Айжан:'500', Атай: '200'};
// Выведите на экран зарплату Атая и Ширин.
// let obj = {Ширин: '1000', Айжан:'500', Атай: '200'}
// console.log(obj2.Атай)

// 4. Создайте объект заработных плат obj = {Ширин: '1000', Айжан:'500', Атай: '200'}.
// Измените зарплату Атая на 500.
// const obj = {Ширин: '1000', Айжан:'500', Атай: '200'}

// 5. Создайте объект заработных плат obj = {Ширин: '1000', Айжан:'500', Атай: '200'}.
// Добавьте к объекту ключ Медет со значением 1500.

// 6. Создайте объект заработных плат obj = {Ширин: '1000', Айжан:'500', Атай: {salary: '500'}.
// Выведите значение ключа salary в консоль.

// 7. Создайте объект с днями недели. Ключами в нем должны служить номера дней
// от начала недели (понедельник - первый и т.д.). Выведите на экран текущий день недели.
// const week = {
//     "1":"Monday",
//     "2":"Tuesday",
//     "3":"wednesday",
//     "4":"thursday",
//     "5":"friday",
//     "6":"saturday",
//     "7":"sunday"
// }
// 8. Пусть теперь номер дня недели хранится в переменной day, например там лежит число 3.
// Выведите день недели, соответствующий значению переменной day.
// let day = "4"
// console.log(week[day])
// 9. Создайте объект заработных плат obj = {Ширин: '1000', Айжан:'500', Атай: {salary: '500'}.
// Получите все ключи объекта.
// let obj2 = {Ширин: '1000', Айжан:'500', Атай: {salary: '500'},
// console.log(obj.keys(obj2))
// 10. Создайте объект заработных плат obj = {Ширин: '1000', Айжан:'500', Атай: {salary: '500'}.
// Получите все значения объекта.

// 11. Создайте объект заработных плат obj = {Ширин: '1000', Айжан:'500', Атай: {salary: '500'}.
// Выведите все entries объекта.

// 12. Создайте функцию, передайте в нее объект {name: 'Igor'}.
// Выведите 1, если длина ключа name нечетная, 0 если четная.
// 13. Создайте функцию, передайте в нее массив с объектами [ {id: 3}, {id: 5}, {id: 6}, {id: 7} ] .
// Выведите все id в консоль через map.
//   let a = [ {id: 3}, {id: 5}, {id: 6}, {id: 7} ]

// 14. Создайте функцию, передайте в нее объект {name: 'Igor'}. Добавьте новый
// ключ age со значением 25. Поменяйте значение name на Azat.

// 15. Вам дан объект product = {
// name: "headphones",
// price: 100,
// discount: 0
// }. Найдите стоимость объекта с ценой, и если она больше 100, снизьте ее на 10%.
//Если это не так, сделайте скидку на 7%. Обновите объект.
// product = {
//     name: "headphones",
//     price: 100,
//     discount:0
// }
// let task15 = (product)=>{
//     if(product.price>100){
//         product.discount = product.price/100*10
//         product.price = product.price -product.discount
//
//         return product
//     }else{
//         product.discout = product.price/100 * 7
//         product.price = product.price - product.discout
//         return product
//     }
// }
// console.log(task15(product))
//
//
// const list1 = [
//     { firstName: 'Emily', lastName: 'N.', country: 'Ireland', continent: 'Europe', age: 30, language: 'Ruby' },
//     { firstName: 'Nor', lastName: 'E.', country: 'Malaysia', continent: 'Asia', age: 20, language: 'Clojure' }
// ];
//[
//   { firstName: 'Emily', lastName: 'N.', country: 'Ireland', continent: 'Europe', age: 30, language: 'Ruby',
//     username: 'emilyn1990' },
//   { firstName: 'Nor', lastName: 'E.', country: 'Malaysia', continent: 'Asia', age: 20, language: 'Clojure',
//     username: 'nore2000' }
// ]

// function addUsername(list){
//     return list.map(user=>{
//         user.username = user.firstName.toLowerCase() + user.lastName.toLowerCase()[0] + (new Data().getFullYear() - user.age)
//         return user
//     })
//     return list.map
// }
//
// const colors = [
//     "AliceBlue",
//     "AntiqueWhite",
//     "Aqua",
//     "Aquamarine",
//     "Azure",
//     "Beige",
//     "Bisque",
//     "Black",
//     "BlanchedAlmond",
//     "Blue",
//     "BlueViolet",
//     "Brown",
//     "BurlyWood",
//     "CadetBlue",
//     "Chartreuse",
//     "Chocolate",
//     "Coral",
//     "CornflowerBlue",
//     "Cornsilk",
//     "Crimson",
//     "Cyan",
//     "DarkBlue",
//     "DarkCyan",
//     "DarkGoldenRod",
//     "DarkGray",
//     "DarkGrey",
//     "DarkGreen",
//     "DarkKhaki",
//     "DarkMagenta",
//     "DarkOliveGreen",
//     "DarkOrange",
//     "DarkOrchid",
//     "DarkRed",
//     "DarkSalmon",
//     "DarkSeaGreen",
//     "DarkSlateBlue",
//     "DarkSlateGray",
//     "DarkSlateGrey",
//     "DarkTurquoise",
//     "DarkViolet",
//     "DeepPink",
//     "DeepSkyBlue",
//     "DimGray",
//     "DimGrey",
//     "DodgerBlue",
//     "FireBrick",
//     "FloralWhite",
//     "ForestGreen",
//     "Fuchsia",
//     "Gainsboro",
//     "GhostWhite",
//     "Gold",
//     "GoldenRod",
//     "Gray",
//     "Grey",
//     "Green",
//     "GreenYellow",
//     "HoneyDew",
//     "HotPink",
//     "IndianRed",
//     "Indigo",
//     "Ivory",
//     "Khaki",
//     "Lavender",
//     "LavenderBlush",
//     "LawnGreen",
//     "LemonChiffon",
//     "LightBlue",
//     "LightCoral",
//     "LightCyan",
//     "LightGoldenRodYellow",
//     "LightGray",
//     "LightGrey",
//     "LightGreen",
//     "LightPink",
//     "LightSalmon",
//     "LightSeaGreen",
//     "LightSkyBlue",
//     "LightSlateGray",
//     "LightSlateGrey",
//     "LightSteelBlue",
//     "LightYellow",
//     "Lime",
//     "LimeGreen",
//     "Linen",
//     "Magenta",
//     "Maroon",
//     "MediumAquaMarine",
//     "MediumBlue",
//     "MediumOrchid",
//     "MediumPurple",
//     "MediumSeaGreen",
//     "MediumSlateBlue",
//     "MediumSpringGreen",
//     "MediumTurquoise",
//     "MediumVioletRed",
//     "MidnightBlue",
//     "MintCream",
//     "MistyRose",
//     "Moccasin",
//     "NavajoWhite",
//     "Navy",
//     "OldLace",
//     "Olive",
//     "OliveDrab",
//     "Orange",
//     "OrangeRed",
//     "Orchid",
//     "PaleGoldenRod",
//     "PaleGreen",
//     "PaleTurquoise",
//     "PaleVioletRed",
//     "PapayaWhip",
//     "PeachPuff",
//     "Peru",
//     "Pink",
//     "Plum",
//     "PowderBlue",
//     "Purple",
//     "RebeccaPurple",
//     "Red",
//     "RosyBrown",
//     "RoyalBlue",
//     "SaddleBrown",
//     "Salmon",
//     "SandyBrown",
//     "SeaGreen",
//     "SeaShell",
//     "Sienna",
//     "Silver",
//     "SkyBlue",
//     "SlateBlue",
//     "SlateGray",
//     "SlateGrey",
//     "Snow",
//     "SpringGreen",
//     "SteelBlue",
//     "Tan",
//     "Teal",
//     "Thistle",
//     "Tomato",
//     "Turquoise",
//     "Violet",
//     "Wheat",
//     "White",
//     "WhiteSmoke",
//     "Yellow",
//     "YellowGreen",
// ];
// const makeObj = (array) => {
//     return array.reduce((acc,el,idx) => {
//         acc[color_${idx + 1}] = el
//         return acc
//     },{})
// }
//
//
// const makeObj = (array) => {
//     return array.reduce((acc,el,idx) => {
//         return {...acc, [color_${idx + 1}] : el}
//     },{})
// }
//
// console.log(makeObj())
//
// //function greet(language) {
//     let greeting = {
//         english: 'Welcome',
//         czech: 'Vitejte',
//         danish: 'Velkomst',
//         dutch: 'Welkom',
//         estonian: 'Tere tulemast',
//         finnish: 'Tervetuloa',
//         flemish: 'Welgekomen',
//         french: 'Bienvenue',
//         german: 'Willkommen',
//         irish: 'Failte',
//         italian: 'Benvenuto',
//         latvian: 'Gaidits',
//         lithuanian: 'Laukiamas',
//         polish: 'Witamy',
//         spanish: 'Bienvenido',
//         swedish: 'Valkommen',
//         welsh: 'Croeso'
//     }
//     return greeting[language] || "welcome"
// }

//console.log((greet)"german")
//console.log((greet)"kyrgyz")


//Task 1
// На входе два одномерных массива. В каждом массиве всегда по два элемента. Верните третий массив результат которого будет
// сумма элементов предыдущих
// Input: [2,4], [1,3]
// Actions:
// Output: [3,7]
//
// Input: [1,7], [9,3]
// Actions:
// Output: [10, 10]
//let a = [2,4] [1,3]
//console.log(a.map(function (el,idx){
  // return el[1] * el[1]
//}))

// console.log(arra.map(function(el,idx){
//     if(idx % 2){
//         return el.toUpperCase()
//     }else{
//        acc.push(el.toLowerCase())
//     }
// }))

// // Task 2
// // Напишите функцию, которая принимает массив чисел и возвращает массив этих чисел умноженных на два
// // Input: [1,2,3,4,5]
// // Output: [2,4,6,8,10]
// // Input: [7,14]
// // Output: [14,28]
//  let nums = [1,2,3,4,5]
//  console.log(nums.map((el)=>{
//      return el * 2
//  }))
//
//  let nums1 = [7, 14]
//  console.log(nums1.map((el)=>{
//     return el * 2
//  }))
// // Task 3 -----
// // Напишите функцию, которая принимает массив объектов с полем id. Например [[{id: '100'}, {id: 2}]] и возвращает массив этих id
// // Input: [{id: 1},{id: 2},{id: 3},{id: 4}]
// // Output: [1,2,3,4]
// //
// // Input: [{id: true}]
// // Output: [true]
// //let obj = [{id: 1},{id: 2},{id: 3},{id: 4}]
// //const makeObj = (obj) => {
//   // if()
//
//
// //}
// // Task 4
// // Напишите функцию, которая принимает массив чисел и возвращает массив строк по шаблону <h1>{number}</h1>
// // Input: [1,2]
// // Output: ['<h1>1</h1>','<h1>2</h1>']
// //
// const task4 = (array)=>{
//     return array.map(el=> <h1> ${el}</h1>)
// }
// console.log(task4([1,2,3,4,5,6,7,8,9,10]))
// // Input: ['Ivan']
// // Output: ['<h1>Ivan</h1>']
// // Task 5
//  //Напишите функцию, которая принимает массив строк и возвращает массив строк с четным количеством букв
//  //Input: ['ab','abc','abcd']
// /// Output: ['ab','abcd']
// //
// console.log(['ab','abs','abcd'].filter(el=>el.length%2===0))
// // Input: ['abc','abcde']
// // Output: []
// // Task 6
// // Напишите функцию, которая принимает массив чисел и возвращает массив чисел умноженных на два, которые делятся на 10 без остатка
// // Input: [1,2,3,7,10,5]
// // Output: [20,10]
// //
//
// // Input: [1,2,3,7,9,4]
// // Output: []
// // Task 7
// // Напишите функцию, которая принимает массив булевых значений и возвращает массив только со значениями true
// // Input: [true,false,true,true]
// // Output: [true,true,true]
// //
// const cleaner = (arr)=>{
//     return arr.filter(el=>el)
// }
// console.log(cleaner([0,":","",true,false,6>7,1/0,{},[]]))
// // Input: [false,true]
// // Output: [true]
// // Task 8
// // Напишите функцию, которая принимает массив значений в т.ч и значения undefined и возвращает массив только без значений undefined
// // Input: [true, false, true,true, undefined, true, undefined]
// // Output: [true, false, true, true, true]
// //
// // Input: [undefined, true, undefined]
// // Output: [true]
// // Task 9
// // Напишите функцию, которая принимает массив чисел и возвращает их сумму. Использовать reduce
// // Input: [1,2,3,4,5]
// // Output: 15
// //
//
// // Input: [2, 11, 5]
// // Output: 18
// // Task 10
// // Напишите функцию, которая принимает массив булевых значений и возвращает результат логического И над ними. Использовать reduce
// // Логическое И - это операция &&
// // Input: [true,true,true,true]
// // Output: true
// //
// console.log([true,true,true,true].reduce((acc,el)=>{
//     return acc && el
// },true))
// // Input: [true,false,true]
// // Output: false
// // Task 11
// // Напишите функцию, которая принимает массив чего угодно и возвращает объект с полями {field1, field2, field3, field4}.
// // Использовать reduce. Готовим баночки и не отчаиваемся. Будет 🔥
// // Input: [true,1,'wow','you are smart, bro']
// // Output: {field1: true, field2:1, field3: 'wow', field4: 'you are smart, bro'}
// const field = [true, 1,'wow','you are smart,bro','javascript','python']
// function task11 (array){
//     return array.reduce((acc,el,idx)=>{
//         return {...  acc, [`field${idx +1}`]:el}
//     },{})
// }
//
// console.log(task11(field))
//
// // Task 12 ------
// // Напишите функцию, которая принимает объект, как аргумент и возвращает новый объект. Только с полями, у которых тип значения - строка;
// // Input: { name: 'Baha', isAdmin: true }
// // Actions:
// // Output: { name: 'Baha' }
// //
// const task12 = (object) =>{
//     return Object.keys(object).reduce((acc,el)=>{
//         console.log(el,object[el])
//         if(typeof object[el] === "string"){
//             return {...acc,[el]:object[el]}
//         }else return acc
//     },{})
// }
// console.log(task12({name:'baha', isAdmin :true}))
// // Input: { isAdmin: true }
// // Actions:
// // Output: {}
//
//
// //filterTypes(dataType, object)
// //filterTypes("number",{name:"Askar", age:15})
// //filterTypes("string",{name: "askar", age:15})
// //{age:15}
// //{age:15}
//
// const task13 = ( dataType,object) =>{
//     return Object.keys(object).reduce((acc,el)=>{
//         console.log(el,object[el])
//         if(typeof object[el] === "number"){
//             return {...acc,[el]:object[el]}
//         }else return acc
//     },{})
// }
// console.log(task13({name:'askar',age:15}))
//[Forwarded from Askar]
// 1. Выведите столбец чисел от 1 до 50.
// let j = 1
//
// do{
//     console.log(j)
//     j++
// }while (j <= 50)
// for (let i = 1; i <= 50; i++){
//     console.log(i)
// }
// 2. Создайте переменную с пустым массивом, заполните массив 10-ю элементами X с помощью цикла.
// function fff() {
//     return "X"
// }
// for (let i = []; i < 10; i++){
//     console.log(i)
//     console.log(fff())
// }

// 3. Вам дан массив с элементами [5, 3, 1, 2, 7]. С помощью цикла for выведите все эти элементы в консоль.
// 4. Вам дан массив с элементами [5, 2, 1, 2]. С помощью цикла for найдите произведение элементов этого массива.
// let a = [5, 2, 1, 2]
// for (let)
// 5. Выведите в консоль столбец четных чисел в промежутке от 0 до 100.
// let numbers = getNumbers(0,80)
// for (let i = 0; i < numbers.length; i++,){
//     if (numbers[i] % 2 === 0){
//         even.push(numbers[i])
//     } else {
//         odd.push(numbers[i])
//     }
// }
// console.log(even)
// console.log(odd)
// 6. С помощью цикла найдите сумму чисел от 1 до 100 и выведите в консоль.
// let v = 0
// for (let i = 1; i <= 100; i++){
// v = v + i
// }
// console.log(v)
// 7. Вам дан массив с элементами [2, 4, 5, 6, 8]. С помощью цикла for найдите сумму элементов этого массива.
// Запишите ее в переменную result.
// let result = 0
// let find =  [2, 4, 5, 6, 8]
//
// for (let i = 0; i < find.length; i++) {
//     result += find[i]
// }
// console.log(result)
// 8. Вам дан массив [3, 4, 6, 12, 3, 5]. С помощью цикла for и оператора if выведите на экран столбец тех элементов массива,
// которые больше 3-х, но меньше 10.
// let get = [3, 4, 6, 12, 3, 5];
// for(let i = 0; i < get.length; i++){
//     if (get[i] > 3 && get[i] < 10){
//         console.log(i)
//     }
// }
// 9. Вам дан массив с числами. Числа могут быть положительными и отрицательными.
// Найдите сумму положительных элементов массива.
// let jh = 0
// let  jk  = [14, -15, 4, 16, -34,89]
// for(let i = 0; i< jk.length; i++){
//     if(jk[i]>0){
// jh += jk[1]
//     }
// }
// console.log(jh)
// // // 10. Вам дан массив с числами [5, 1, 3, 7, 6, 15, 3, 20]. С помощью цикла for и оператора if
// // проверьте есть ли в массиве элемент со значением, равным 4. Если есть - выведите на экран 'Есть!' и выйдите из цикла.
// // Если нет - ничего делать не надо.
// let jm = [5, 1, 3, 7, 6, 15, 3, 20]
// for (let i = 0; i< jm.length; i++){
//     if(jm[i] ===4){
//         console.log("есть")
//     }
// }
//
// // 11. Вам дан массив числами [10, 20, 30, 40, 135, 2000].
// // Выведите на экран только те числа из массива, которые начинаются на цифру 1, 2 или 5.
// let numbers =[10, 20, 30, 40, 135, 2000]
// for(let i = 0; i< numbers.length; i ++){
//
// }
// 12. Вам дан массив с элементами [1, 2, 3, 4, 5, 6, 7, 8, 9]. С помощью цикла for создайте строку '-1-2-3-4-5-6-7-8-9-'.
// 13. Вам дано число n=1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для этого (итерация - это проход цикла), и запишите его в переменную num.
// let n = 1000000
// let counter = 0
// for(let i = n; i > 50; i/2){
//     console.log(`${i} / 2 = ${i/2}`)
//     counter ++
// }
// console.log(counter)
// 14. Вам дан массив с числами [1, 2, 3, 7, 6, 9].
// Найдите среднее арифметическое его элементов (сумма элементов, делить на количество).

// 15. Вам дан массив с числами [1, 2, 3, 4, 5].
// С помощью цикла найдите сумму квадратов элементов этого массива.
// let arrayNum = [1, 2, 3, 4, 5]
// let b = []
//  for(let i = 0; i<arrayNum.length; i++){
//      b[i] = arrayNum[i] **2
//  }
// console.log(b)
// 16. Вам дан массив с числами [1, 2, 4, -1, -3, 8, 7, 0, -5, 18, 12].
// С помощью цикла выведите только те элементы массива, которые больше нуля и меньше 10-ти.

// 17. Создайте переменную с пустым массивом,
// заполните массив 10-ю случайными числами от 1 до 10 с помощью цикла.
// let rm = []
// let random = Maht.floor(Maht.random() * 10 +1)
// console.log(random)
// for(let i =0; i<11; i++ ){
//     rm[i] = random
// }
// console.log("random",rm)
// // 18. Создайте цикл, который суммирует числа, кратные 3 и 5 до 1000.
// for(let i = 1; i<101; i++){
//     if(i % 3 === 0 && i % 5 ===0){
//         console.log(i)
//     }
// }
// 19. Вам дан массив [2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21].
// Создайте цикл, который выводит нечетные числа, которые больше 10.

// 20. Вам дана строка 'jzvzszrzpz'. Измените каждую вторую букву на верхний регистр.
// let a = 10; let b = "10";
// console.log(a == b)